# Data Alignment

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [24]:
ser1 = Series(np.arange(3), index=['A','B','C'])
ser2 = Series(np.arange(3,7), index=['A','B','C','D'])
ser1+ser2 # problem

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [32]:
df = DataFrame(np.arange(4).reshape((2,2)),index=['NYC','LA'],columns=list('AB'))
df2=DataFrame(np.arange(9).reshape((3,3)),index=['NYC','SF','LA'],columns=list('ADC'))
df+df2 # PROBLEM

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

## fill_value

In [33]:
df.add(df2, fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [34]:
df2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [35]:
ser3 = df2.iloc[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [37]:
df2-ser3 # Series - dataframe

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6